balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ128MC506.PIC
    <edc:Pin>
      <!--Pin 47-->
      <edc:VirtualPin edc:name="PGED2"/>
      <edc:VirtualPin edc:name="SOSCI"/>
      <edc:VirtualPin edc:name="T4CK"/>
      <edc:VirtualPin edc:name="CN1"/>
      <edc:VirtualPin edc:name="RC13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 48-->
      <edc:VirtualPin edc:name="PGEC2"/>
      <edc:VirtualPin edc:name="SOSCO"/>
      <edc:VirtualPin edc:name="T1CK"/>
      <edc:VirtualPin edc:name="CN0"/>
      <edc:VirtualPin edc:name="RC14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 49-->
      <edc:VirtualPin edc:name="OC2"/>
      <edc:VirtualPin edc:name="RD1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 50-->
      <edc:VirtualPin edc:name="OC3"/>
      <edc:VirtualPin edc:name="RD2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 51-->
      <edc:VirtualPin edc:name="OC4"/>
      <edc:VirtualPin edc:name="RD3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 52-->
      <edc:VirtualPin edc:name="OC5"/>
      <edc:VirtualPin edc:name="IC5"/>
      <edc:VirtualPin edc:name="CN13"/>
      <edc:VirtualPin edc:name="RD4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 53-->
      <edc:VirtualPin edc:name="OC6"/>
      <edc:VirtualPin edc:name="IC6"/>
      <edc:VirtualPin edc:name="CN14"/>
      <edc:VirtualPin edc:name="RD5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 54-->
      <edc:VirtualPin edc:name="OC7"/>
      <edc:VirtualPin edc:name="CN15"/>
      <edc:VirtualPin edc:name="RD6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 55-->
      <edc:VirtualPin edc:name="OC8"/>
      <edc:VirtualPin edc:name="UPDN"/>
      <edc:VirtualPin edc:name="CN16"/>
      <edc:VirtualPin edc:name="RD7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 56-->
      <edc:VirtualPin edc:name="Vcap"/>
      <edc:VirtualPin edc:name="Vddcore"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 57-->
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 58-->
      <edc:VirtualPin edc:name="C1RX"/>
      <edc:VirtualPin edc:name="RF0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 59-->
      <edc:VirtualPin edc:name="C1TX"/>
      <edc:VirtualPin edc:name="RF1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 60-->
      <edc:VirtualPin edc:name="PWM1L"/>
      <edc:VirtualPin edc:name="RE0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 61-->
      <edc:VirtualPin edc:name="PWM1H"/>
      <edc:VirtualPin edc:name="RE1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 62-->
      <edc:VirtualPin edc:name="PWM2L"/>
      <edc:VirtualPin edc:name="RE2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 63-->
      <edc:VirtualPin edc:name="PWM2H"/>
      <edc:VirtualPin edc:name="RE3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 64-->
      <edc:VirtualPin edc:name="PWM3L"/>
      <edc:VirtualPin edc:name="RE4"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>